
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/autoupdate"
tap "buo/cask-upgrade"
tap "rsteube/homebrew-tap"
tap "FelixKratz/formulae"
#txn2/tap/kubefwd

cask "battery"
cask "devtoys"
cask "eloston-chromium"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gdisk"
cask "jordanbaird-ice"
cask "keka"
cask "key-codes"
cask "kitty"
cask "maccy"
cask "obs"
cask "qbittorrent"
cask "suspicious-package"
cask "shutter-encoder"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "xquartz"
#cask "karabiner-elements"

brew "ast-grep"
brew "bat"
brew "borders"
brew "btop"
brew "carapace"
brew "cargo-nextest"
brew "codespell"
brew "coreutils"
brew "dust"
brew "fd"
brew "fnm"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "hblock"
brew "htop"
brew "hub"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "molten-vk"
brew "mpv"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nushell"
brew "openssh"
brew "openssl"
brew "pinentry-mac"
brew "pyenv"
brew "ripgrep"
brew "sccache"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tlrc"
brew "tree-sitter"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "jordanbaird-ice"

#brew  autoupdate start 43200 --upgrade --cleanup --immediate --sudo
