
tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "rsteube/tap"
# tap "txn2/tap"

cask "amethyst"
cask "battery"
cask "eloston-chromium"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gdisk"
cask "jordanbaird-ice"
cask "keka"
cask "key-codes"
cask "kitty"
cask "maccy"
cask "obs"
cask "pearcleaner"
cask "qbittorrent"
cask "shutter-encoder"
cask "suspicious-package"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "xquartz"
#cask "karabiner-elements"

brew "ast-grep"
brew "ca-certificates"
brew "bat"
brew "borders"
brew "broot"
brew "btop"
brew "bun"
brew "carapace"
brew "cargo-nextest"
brew "coreutils"
brew "dust"
brew "fd"
brew "fnm"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnupg"
brew "gstreamer"
brew "hblock"
brew "htop"
brew "hub"
brew "jq"
#brew "kubefwd"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "molten-vk"
brew "mpv"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "nushell"
brew "openssh"
brew "pinentry-mac"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "tlrc"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-completions"

#brew  autoupdate start 43200 --upgrade --cleanup --immediate --sudo

mas "AdGuard for Safari", id: 1440147259
mas "Codepoint", id: 6444068649
mas "DaisyDisk", id: 411643860
mas "Dark Night", id: 1592844577
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Dictionaries", id: 1380563956
mas "Ice Cubes", id: 6444915884
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Redirect Web for Safari", id: 1571283503
mas "Reeder", id: 1529448980
mas "StopTheMadness Pro", id: 6471380298
mas "TestFlight", id: 899247664
mas "Video Converter", id: 1518836004
mas "Xcode", id: 497799835
mas "Yesterday For Old Reddit", id: 1603279883
